{
  "id": "clasp-basics",
  "title": "CLASP Basics",
  "description": "Essential clasp commands for everyday Apps Script development",
  "difficulty": "beginner",
  "estimatedTime": "30 min",
  "cardCount": 30,
  "cards": [
    {
      "id": "basics-001",
      "task": "Authenticate with your Google Account",
      "answer": "clasp login [options]",
      "description": "Authorizes clasp to manage your Google account's Apps Script projects. This creates a credentials file that allows clasp to interact with your scripts.",
      "whenToUse": "Required before using any other clasp commands. Run this when you first install clasp or need to switch Google accounts.",
      "scenarios": [
        "First-time setup: After installing clasp globally, run this to authorize access to your Apps Script projects",
        "Switching accounts: Use --creds flag to manage multiple Google accounts for different client projects",
        "CI/CD setup: Use --no-localhost flag when setting up automated deployments on headless servers"
      ]
    },
    {
      "id": "basics-002",
      "task": "Sign out from your Google Account",
      "answer": "clasp logout",
      "description": "Removes the stored credentials from your local machine, terminating the current session. You'll need to login again to use clasp commands.",
      "whenToUse": "When switching between different Google accounts, securing a shared computer, or troubleshooting authentication issues.",
      "scenarios": [
        "Account switching: Logging out before authenticating with a different Google account for a new project",
        "Security: Removing credentials from a shared development machine before stepping away",
        "Troubleshooting: Clearing stored credentials when experiencing permission errors or authentication issues"
      ]
    },
    {
      "id": "basics-003",
      "task": "Open the OAuth 2.0 credentials setup",
      "answer": "clasp open-credentials-setup",
      "description": "Opens the Google Cloud Console page where you can create OAuth 2.0 credentials needed for advanced clasp features like running functions remotely.",
      "whenToUse": "When you need to set up credentials for clasp run or want to use a custom OAuth client instead of the default one.",
      "scenarios": [
        "Advanced setup: Creating OAuth credentials before using 'clasp run' to execute functions remotely",
        "Custom authentication: Setting up organization-specific OAuth clients for enterprise deployments",
        "API enablement: Accessing the console to enable additional Google APIs for your project"
      ]
    },
    {
      "id": "basics-004",
      "task": "Clone an existing Apps Script project",
      "answer": "clasp clone-script [scriptId] [versionNumber] [options]",
      "description": "Downloads an existing Apps Script project from Google Drive to your local filesystem. Creates a .clasp.json file linking your local directory to the remote project.",
      "whenToUse": "When you want to work locally on a project created in the online editor, collaborate on a shared project, or set up version control for an existing script.",
      "scenarios": [
        "Team collaboration: Cloning a colleague's shared script to contribute code from your local development environment",
        "Local development: Moving an existing web-based script to your preferred IDE with Git version control",
        "Version management: Using --versionNumber to clone a specific historical version for debugging or rollback purposes"
      ]
    },
    {
      "id": "basics-005",
      "task": "Create a new Apps Script project",
      "answer": "clasp create-script [options]",
      "description": "Creates a new Apps Script project in your current directory and on Google Drive. Generates .clasp.json (with script ID) and appsscript.json (manifest) files.",
      "whenToUse": "When starting a new Apps Script project from scratch with local development in mind.",
      "scenarios": [
        "New standalone project: Creating a standalone script for a custom automation tool",
        "Container-bound script: Using --type sheets to create a script bound to a specific Google Sheet",
        "Add-on development: Starting a new Google Workspace add-on with --title and --type flags for proper setup"
      ]
    },
    {
      "id": "basics-006",
      "task": "Push local files to the script",
      "answer": "clasp push [options]",
      "description": "Uploads your local code files to Google Apps Script. This syncs your local changes to the cloud, making them available in the online editor.",
      "whenToUse": "After making local code changes that you want to deploy to the cloud version of your script.",
      "scenarios": [
        "Development workflow: Pushing code changes after testing locally to make them available in the script editor",
        "Continuous deployment: Using --watch flag to automatically push changes as you save files during development",
        "Force update: Using --force to overwrite cloud changes when you know your local version is correct"
      ]
    },
    {
      "id": "basics-007",
      "task": "Pull script files from the cloud",
      "answer": "clasp pull [options]",
      "description": "Downloads the latest version of your Apps Script project from Google Drive to your local filesystem, overwriting local files.",
      "whenToUse": "When you need to sync cloud changes made in the online editor to your local environment, or when collaborating with others.",
      "scenarios": [
        "Sync after web edits: Pulling changes you or a teammate made in the online Apps Script editor",
        "Collaboration: Retrieving updates from collaborators who pushed changes to the shared project",
        "Version retrieval: Using --versionNumber to pull a specific historical version for comparison or recovery"
      ]
    },
    {
      "id": "basics-008",
      "task": "Create a new deployment",
      "answer": "clasp create-deployment [options]",
      "description": "Publishes your script as a deployment that can be used as a web app, API executable, or add-on. Each deployment has a unique ID and URL.",
      "whenToUse": "When you want to create a production version of your script that end-users can access.",
      "scenarios": [
        "Web app release: Deploying a new version of your web application for users to access via URL",
        "API deployment: Creating an API executable deployment that can be called by external services",
        "Add-on publishing: Deploying a new version of your Workspace add-on for testing or production use"
      ]
    },
    {
      "id": "basics-009",
      "task": "Delete an Apps Script project",
      "answer": "clasp delete-script [scriptId] [options]",
      "description": "Permanently removes an Apps Script project from Google Drive. This action cannot be undone.",
      "whenToUse": "When you need to completely remove a script project that's no longer needed.",
      "scenarios": [
        "Project cleanup: Removing test or prototype projects that are no longer relevant",
        "Resource management: Deleting duplicate or obsolete projects to keep your script library organized",
        "Security: Removing scripts containing sensitive code that should no longer be accessible"
      ]
    },
    {
      "id": "basics-010",
      "task": "Remove a deployment version",
      "answer": "clasp delete-deployment [deploymentId] [options]",
      "description": "Removes a specific deployment of your script, making it inaccessible to users. The script code remains, but the deployed version is retired.",
      "whenToUse": "When you need to retire an old version or remove a deployment that has critical bugs.",
      "scenarios": [
        "Version retirement: Undeploying old versions after all users have migrated to a newer release",
        "Emergency rollback: Quickly removing a buggy deployment while you fix the issues",
        "Deployment cleanup: Using --all flag to remove all deployments when starting fresh"
      ]
    },
    {
      "id": "basics-011",
      "task": "List all deployment versions for a script",
      "answer": "clasp list-deployments [scriptId]",
      "description": "Displays all active deployments for your script, showing deployment IDs, versions, and descriptions.",
      "whenToUse": "When you need to see what versions are currently deployed and accessible to users.",
      "scenarios": [
        "Version audit: Checking which versions are currently live before deploying a new update",
        "Deployment management: Getting deployment IDs to undeploy or redeploy specific versions",
        "Troubleshooting: Verifying that users are accessing the intended version of your web app"
      ]
    },
    {
      "id": "basics-012",
      "task": "Update an existing deployment version",
      "answer": "clasp update-deployment <deploymentId> [options]",
      "description": "Updates an existing deployment to point to a new version of your code while maintaining the same deployment ID and URL.",
      "whenToUse": "When you want to update a deployed version without changing the URL that users access.",
      "scenarios": [
        "Seamless updates: Updating your web app without requiring users to change their bookmarked URL",
        "Production releases: Pushing new features to your production deployment while maintaining the same endpoint",
        "Bug fixes: Quickly updating a live deployment with a critical fix without deployment URL changes"
      ]
    },
    {
      "id": "basics-013",
      "task": "Disable a Google API for the script",
      "answer": "clasp disable-api <api>",
      "description": "Removes access to a specific Google API from your Apps Script project's advanced services.",
      "whenToUse": "When you no longer need a particular API and want to reduce your project's permissions.",
      "scenarios": [
        "Security hardening: Removing unused APIs to follow principle of least privilege",
        "Permission cleanup: Disabling APIs after refactoring code that no longer requires them",
        "Troubleshooting: Temporarily disabling an API to isolate permission or quota issues"
      ]
    },
    {
      "id": "basics-014",
      "task": "Enable a Google API for the script",
      "answer": "clasp enable-api <api>",
      "description": "Adds access to a specific Google API (like Drive, Gmail, Calendar) to your Apps Script project, allowing your code to use advanced API features.",
      "whenToUse": "When your script needs to use Google services beyond the basic built-in Apps Script services.",
      "scenarios": [
        "Advanced features: Enabling Drive API to access advanced file management features not in DriveApp",
        "External integrations: Enabling Admin SDK for G Suite domain management scripts",
        "Service expansion: Adding Calendar API when building a scheduling automation tool"
      ]
    },
    {
      "id": "basics-015",
      "task": "List all available Google APIs",
      "answer": "clasp list-apis",
      "description": "Shows all Google APIs that can be enabled for your Apps Script project, along with their current status (enabled/disabled).",
      "whenToUse": "When you need to discover which APIs are available or check which ones are currently enabled.",
      "scenarios": [
        "API discovery: Finding the exact API name needed for enable-api command",
        "Project audit: Reviewing which APIs are enabled to understand script dependencies",
        "Planning: Checking API availability before designing new script features"
      ]
    },
    {
      "id": "basics-016",
      "task": "Open the Google Cloud Console for the project",
      "answer": "clasp open-api-console",
      "description": "Opens the Google Cloud Platform Console for your script's associated cloud project in your web browser.",
      "whenToUse": "When you need to manage advanced cloud settings, view API quotas, or configure OAuth consent screens.",
      "scenarios": [
        "Quota management: Checking API usage limits and requesting quota increases",
        "OAuth configuration: Setting up consent screens for add-ons or web apps with external users",
        "Service accounts: Creating service accounts for server-to-server authentication scenarios"
      ]
    },
    {
      "id": "basics-017",
      "task": "Display the authorized Google Account email",
      "answer": "clasp show-authorized-user",
      "description": "Shows which Google account is currently authenticated and being used by clasp for all operations.",
      "whenToUse": "When you need to verify which account you're operating under, especially when managing multiple accounts.",
      "scenarios": [
        "Account verification: Confirming you're using the correct account before pushing sensitive changes",
        "Multi-account management: Checking which account is active when switching between client projects",
        "Troubleshooting: Verifying authentication when experiencing permission errors"
      ]
    },
    {
      "id": "basics-018",
      "task": "Show the current file status",
      "answer": "clasp show-file-status",
      "description": "Displays the synchronization status between your local files and the cloud version, showing which files have been modified.",
      "whenToUse": "When you want to see what changes will be pushed before running clasp push.",
      "scenarios": [
        "Pre-push review: Checking which files have changed before pushing to avoid unintended updates",
        "Sync verification: Confirming your local and cloud versions are in sync after pulling",
        "Change tracking: Identifying which files were modified during a development session"
      ]
    },
    {
      "id": "basics-019",
      "task": "Open the Apps Script execution logs",
      "answer": "clasp open-logs",
      "description": "Opens the Stackdriver Logging page in your browser where you can view detailed execution logs for your script.",
      "whenToUse": "When you need to debug issues or view detailed execution history using the web interface.",
      "scenarios": [
        "Detailed debugging: Accessing the full web interface for complex log filtering and analysis",
        "Historical review: Viewing execution logs from several days or weeks ago",
        "Log export: Using the web interface to export logs for reporting or long-term storage"
      ]
    },
    {
      "id": "basics-020",
      "task": "Set up StackDriver logging configuration",
      "answer": "clasp setup-logs",
      "description": "Configures Stackdriver (Cloud Logging) for your script, enabling enhanced logging capabilities and log retention.",
      "whenToUse": "When you need advanced logging features beyond the basic Apps Script logs.",
      "scenarios": [
        "Production monitoring: Setting up enhanced logging for a production web app to track usage patterns",
        "Log retention: Configuring longer log retention periods for compliance or audit requirements",
        "Advanced debugging: Enabling detailed log levels for troubleshooting complex issues"
      ]
    },
    {
      "id": "basics-021",
      "task": "Stream the script execution logs in real-time",
      "answer": "clasp tail-logs [options]",
      "description": "Streams execution logs directly to your terminal in real-time, showing console.log output and errors as they occur.",
      "whenToUse": "When debugging your script and you want to see logs without leaving the terminal.",
      "scenarios": [
        "Live debugging: Watching logs in real-time while testing your script's functionality",
        "Error monitoring: Using --watch flag to continuously monitor for errors in a running web app",
        "Development workflow: Viewing console.log output while developing without switching to the browser"
      ]
    },
    {
      "id": "basics-022",
      "task": "Open the Apps Script editor in browser",
      "answer": "clasp open-script [scriptId]",
      "description": "Opens your Apps Script project in the online editor in your default web browser.",
      "whenToUse": "When you need to quickly access the web editor for visual editing, project settings, or features not available in clasp.",
      "scenarios": [
        "Visual editing: Opening the editor to use the UI builder for creating custom menus or dialogs",
        "Project settings: Accessing the web interface to configure triggers, libraries, or permissions",
        "Quick checks: Verifying how your code appears in the online editor or testing the script there"
      ]
    },
    {
      "id": "basics-023",
      "task": "Open the container-bound document/sheet",
      "answer": "clasp open-container",
      "description": "Opens the Google Doc, Sheet, Form, or Slides presentation that your script is bound to in your web browser.",
      "whenToUse": "When working with container-bound scripts and you need to access the parent document.",
      "scenarios": [
        "Sheet testing: Opening the bound spreadsheet to test custom menu items or sheet functions",
        "Form configuration: Accessing the form that your script processes submissions for",
        "Document context: Viewing the document structure while developing container-bound automation"
      ]
    },
    {
      "id": "basics-024",
      "task": "Open the deployed web app in browser",
      "answer": "clasp open-web-app [deploymentId]",
      "description": "Opens a specific deployment of your web app in your browser, using the deployment's public URL.",
      "whenToUse": "When you want to quickly test or view a deployed version of your web application.",
      "scenarios": [
        "Deployment testing: Opening a new deployment to verify it's working correctly before sharing with users",
        "Version comparison: Opening different deployment IDs to compare behavior between versions",
        "Quick access: Launching your web app without manually copying and pasting the deployment URL"
      ]
    },
    {
      "id": "basics-025",
      "task": "Execute a function in the script",
      "answer": "clasp run-function [functionName] [options]",
      "description": "Remotely executes a specific function in your Apps Script project directly from the command line, returning the results to your terminal.",
      "whenToUse": "When you want to test functions or run one-off scripts without manually triggering them in the editor.",
      "scenarios": [
        "Function testing: Running and testing individual functions during development without the web editor",
        "One-off tasks: Executing data migration or cleanup functions from your terminal",
        "CI/CD integration: Running test functions as part of automated deployment pipelines"
      ]
    },
    {
      "id": "basics-026",
      "task": "List all Apps Script projects for current user",
      "answer": "clasp list-scripts [options]",
      "description": "Displays all Apps Script projects accessible by your currently authenticated Google account, showing script IDs and titles.",
      "whenToUse": "When you need to find a script ID or see all your available projects.",
      "scenarios": [
        "Script discovery: Finding the script ID of a project you want to clone",
        "Project inventory: Viewing all your scripts to decide which ones to work on locally",
        "Account audit: Checking what script projects are associated with your Google account"
      ]
    },
    {
      "id": "basics-027",
      "task": "Create a new version of the script",
      "answer": "clasp create-version [description]",
      "description": "Creates an immutable snapshot of your current script code as a numbered version. This version can then be deployed.",
      "whenToUse": "When you want to create a stable reference point before deploying or making major changes.",
      "scenarios": [
        "Pre-deployment: Creating a version with a description before deploying to production",
        "Release tagging: Marking significant milestones like 'v2.0 - Added user authentication'",
        "Safe refactoring: Creating a version before major code changes so you can easily revert if needed"
      ]
    },
    {
      "id": "basics-028",
      "task": "List all versions of a script project",
      "answer": "clasp list-versions [scriptId]",
      "description": "Shows all saved versions of your script with their version numbers, descriptions, and creation dates.",
      "whenToUse": "When you need to review version history or find a specific version number for deployment or rollback.",
      "scenarios": [
        "Version audit: Reviewing the history of your project to understand when changes were made",
        "Rollback planning: Finding the version number of a stable release to redeploy",
        "Documentation: Getting version information for release notes or change logs"
      ]
    },
    {
      "id": "basics-029",
      "task": "Start the Model Context Protocol server",
      "answer": "clasp mcp",
      "description": "Starts a Model Context Protocol (MCP) server that allows AI assistants and tools to interact with your Apps Script projects through a standardized interface.",
      "whenToUse": "When you want to enable AI-assisted development or integrate your Apps Script projects with MCP-compatible tools.",
      "scenarios": [
        "AI development: Enabling an AI assistant like Claude to help write and modify your Apps Script code",
        "Tool integration: Connecting automated development tools that use the MCP protocol",
        "Enhanced workflows: Using MCP-compatible IDEs that provide enhanced Apps Script development features"
      ]
    }
  ]
}
