{
  "clasp-basics": [
    {
      "task": "Authenticate with your Google Account",
      "answer": "clasp login [options]",
      "description": "Authorizes clasp to manage your Google account's Apps Script projects. This creates a credentials file that allows clasp to interact with your scripts.",
      "whenToUse": "Required before using any other clasp commands. Run this when you first install clasp or need to switch Google accounts.",
      "scenarios": [
        "First-time setup: After installing clasp globally, run this to authorize access to your Apps Script projects",
        "Switching accounts: Use --creds flag to manage multiple Google accounts for different client projects",
        "CI/CD setup: Use --no-localhost flag when setting up automated deployments on headless servers"
      ]
    },
    {
      "task": "Sign out from your Google Account",
      "answer": "clasp logout",
      "description": "Removes the stored credentials from your local machine, terminating the current session. You'll need to login again to use clasp commands.",
      "whenToUse": "When switching between different Google accounts, securing a shared computer, or troubleshooting authentication issues.",
      "scenarios": [
        "Account switching: Logging out before authenticating with a different Google account for a new project",
        "Security: Removing credentials from a shared development machine before stepping away",
        "Troubleshooting: Clearing stored credentials when experiencing permission errors or authentication issues"
      ]
    },
    {
      "task": "Open the OAuth 2.0 credentials setup",
      "answer": "clasp open-credentials-setup",
      "description": "Opens the Google Cloud Console page where you can create OAuth 2.0 credentials needed for advanced clasp features like running functions remotely.",
      "whenToUse": "When you need to set up credentials for clasp run or want to use a custom OAuth client instead of the default one.",
      "scenarios": [
        "Advanced setup: Creating OAuth credentials before using 'clasp run' to execute functions remotely",
        "Custom authentication: Setting up organization-specific OAuth clients for enterprise deployments",
        "API enablement: Accessing the console to enable additional Google APIs for your project"
      ]
    },
    {
      "task": "Clone an existing Apps Script project",
      "answer": "clasp clone-script [scriptId] [versionNumber] [options]",
      "description": "Downloads an existing Apps Script project from Google Drive to your local filesystem. Creates a .clasp.json file linking your local directory to the remote project.",
      "whenToUse": "When you want to work locally on a project created in the online editor, collaborate on a shared project, or set up version control for an existing script.",
      "scenarios": [
        "Team collaboration: Cloning a colleague's shared script to contribute code from your local development environment",
        "Local development: Moving an existing web-based script to your preferred IDE with Git version control",
        "Version management: Using --versionNumber to clone a specific historical version for debugging or rollback purposes"
      ]
    },
    {
      "task": "Create a new Apps Script project",
      "answer": "clasp create-script [options]",
      "description": "Creates a new Apps Script project in your current directory and on Google Drive. Generates .clasp.json (with script ID) and appsscript.json (manifest) files.",
      "whenToUse": "When starting a new Apps Script project from scratch with local development in mind.",
      "scenarios": [
        "New standalone project: Creating a standalone script for a custom automation tool",
        "Container-bound script: Using --type sheets to create a script bound to a specific Google Sheet",
        "Add-on development: Starting a new Google Workspace add-on with --title and --type flags for proper setup"
      ]
    },
    {
      "task": "Push local files to the script",
      "answer": "clasp push [options]",
      "description": "Uploads your local code files to Google Apps Script. This syncs your local changes to the cloud, making them available in the online editor.",
      "whenToUse": "After making local code changes that you want to deploy to the cloud version of your script.",
      "scenarios": [
        "Development workflow: Pushing code changes after testing locally to make them available in the script editor",
        "Continuous deployment: Using --watch flag to automatically push changes as you save files during development",
        "Force update: Using --force to overwrite cloud changes when you know your local version is correct"
      ]
    },
    {
      "task": "Pull script files from the cloud",
      "answer": "clasp pull [options]",
      "description": "Downloads the latest version of your Apps Script project from Google Drive to your local filesystem, overwriting local files.",
      "whenToUse": "When you need to sync cloud changes made in the online editor to your local environment, or when collaborating with others.",
      "scenarios": [
        "Sync after web edits: Pulling changes you or a teammate made in the online Apps Script editor",
        "Collaboration: Retrieving updates from collaborators who pushed changes to the shared project",
        "Version retrieval: Using --versionNumber to pull a specific historical version for comparison or recovery"
      ]
    },
    {
      "task": "Create a new deployment",
      "answer": "clasp create-deployment [options]",
      "description": "Publishes your script as a deployment that can be used as a web app, API executable, or add-on. Each deployment has a unique ID and URL.",
      "whenToUse": "When you want to create a production version of your script that end-users can access.",
      "scenarios": [
        "Web app release: Deploying a new version of your web application for users to access via URL",
        "API deployment: Creating an API executable deployment that can be called by external services",
        "Add-on publishing: Deploying a new version of your Workspace add-on for testing or production use"
      ]
    },
    {
      "task": "Delete an Apps Script project",
      "answer": "clasp delete-script [scriptId] [options]",
      "description": "Permanently removes an Apps Script project from Google Drive. This action cannot be undone.",
      "whenToUse": "When you need to completely remove a script project that's no longer needed.",
      "scenarios": [
        "Project cleanup: Removing test or prototype projects that are no longer relevant",
        "Resource management: Deleting duplicate or obsolete projects to keep your script library organized",
        "Security: Removing scripts containing sensitive code that should no longer be accessible"
      ]
    },
    {
      "task": "Remove a deployment version",
      "answer": "clasp delete-deployment [deploymentId] [options]",
      "description": "Removes a specific deployment of your script, making it inaccessible to users. The script code remains, but the deployed version is retired.",
      "whenToUse": "When you need to retire an old version or remove a deployment that has critical bugs.",
      "scenarios": [
        "Version retirement: Undeploying old versions after all users have migrated to a newer release",
        "Emergency rollback: Quickly removing a buggy deployment while you fix the issues",
        "Deployment cleanup: Using --all flag to remove all deployments when starting fresh"
      ]
    },
    {
      "task": "List all deployment versions for a script",
      "answer": "clasp list-deployments [scriptId]",
      "description": "Displays all active deployments for your script, showing deployment IDs, versions, and descriptions.",
      "whenToUse": "When you need to see what versions are currently deployed and accessible to users.",
      "scenarios": [
        "Version audit: Checking which versions are currently live before deploying a new update",
        "Deployment management: Getting deployment IDs to undeploy or redeploy specific versions",
        "Troubleshooting: Verifying that users are accessing the intended version of your web app"
      ]
    },
    {
      "task": "Update an existing deployment version",
      "answer": "clasp update-deployment <deploymentId> [options]",
      "description": "Updates an existing deployment to point to a new version of your code while maintaining the same deployment ID and URL.",
      "whenToUse": "When you want to update a deployed version without changing the URL that users access.",
      "scenarios": [
        "Seamless updates: Updating your web app without requiring users to change their bookmarked URL",
        "Production releases: Pushing new features to your production deployment while maintaining the same endpoint",
        "Bug fixes: Quickly updating a live deployment with a critical fix without deployment URL changes"
      ]
    },
    {
      "task": "Disable a Google API for the script",
      "answer": "clasp disable-api <api>",
      "description": "Removes access to a specific Google API from your Apps Script project's advanced services.",
      "whenToUse": "When you no longer need a particular API and want to reduce your project's permissions.",
      "scenarios": [
        "Security hardening: Removing unused APIs to follow principle of least privilege",
        "Permission cleanup: Disabling APIs after refactoring code that no longer requires them",
        "Troubleshooting: Temporarily disabling an API to isolate permission or quota issues"
      ]
    },
    {
      "task": "Enable a Google API for the script",
      "answer": "clasp enable-api <api>",
      "description": "Adds access to a specific Google API (like Drive, Gmail, Calendar) to your Apps Script project, allowing your code to use advanced API features.",
      "whenToUse": "When your script needs to use Google services beyond the basic built-in Apps Script services.",
      "scenarios": [
        "Advanced features: Enabling Drive API to access advanced file management features not in DriveApp",
        "External integrations: Enabling Admin SDK for G Suite domain management scripts",
        "Service expansion: Adding Calendar API when building a scheduling automation tool"
      ]
    },
    {
      "task": "List all available Google APIs",
      "answer": "clasp list-apis",
      "description": "Shows all Google APIs that can be enabled for your Apps Script project, along with their current status (enabled/disabled).",
      "whenToUse": "When you need to discover which APIs are available or check which ones are currently enabled.",
      "scenarios": [
        "API discovery: Finding the exact API name needed for enable-api command",
        "Project audit: Reviewing which APIs are enabled to understand script dependencies",
        "Planning: Checking API availability before designing new script features"
      ]
    },
    {
      "task": "Open the Google Cloud Console for the project",
      "answer": "clasp open-api-console",
      "description": "Opens the Google Cloud Platform Console for your script's associated cloud project in your web browser.",
      "whenToUse": "When you need to manage advanced cloud settings, view API quotas, or configure OAuth consent screens.",
      "scenarios": [
        "Quota management: Checking API usage limits and requesting quota increases",
        "OAuth configuration: Setting up consent screens for add-ons or web apps with external users",
        "Service accounts: Creating service accounts for server-to-server authentication scenarios"
      ]
    },
    {
      "task": "Display the authorized Google Account email",
      "answer": "clasp show-authorized-user",
      "description": "Shows which Google account is currently authenticated and being used by clasp for all operations.",
      "whenToUse": "When you need to verify which account you're operating under, especially when managing multiple accounts.",
      "scenarios": [
        "Account verification: Confirming you're using the correct account before pushing sensitive changes",
        "Multi-account management: Checking which account is active when switching between client projects",
        "Troubleshooting: Verifying authentication when experiencing permission errors"
      ]
    },
    {
      "task": "Show the current file status",
      "answer": "clasp show-file-status",
      "description": "Displays the synchronization status between your local files and the cloud version, showing which files have been modified.",
      "whenToUse": "When you want to see what changes will be pushed before running clasp push.",
      "scenarios": [
        "Pre-push review: Checking which files have changed before pushing to avoid unintended updates",
        "Sync verification: Confirming your local and cloud versions are in sync after pulling",
        "Change tracking: Identifying which files were modified during a development session"
      ]
    },
    {
      "task": "Open the Apps Script execution logs",
      "answer": "clasp open-logs",
      "description": "Opens the Stackdriver Logging page in your browser where you can view detailed execution logs for your script.",
      "whenToUse": "When you need to debug issues or view detailed execution history using the web interface.",
      "scenarios": [
        "Detailed debugging: Accessing the full web interface for complex log filtering and analysis",
        "Historical review: Viewing execution logs from several days or weeks ago",
        "Log export: Using the web interface to export logs for reporting or long-term storage"
      ]
    },
    {
      "task": "Set up StackDriver logging configuration",
      "answer": "clasp setup-logs",
      "description": "Configures Stackdriver (Cloud Logging) for your script, enabling enhanced logging capabilities and log retention.",
      "whenToUse": "When you need advanced logging features beyond the basic Apps Script logs.",
      "scenarios": [
        "Production monitoring: Setting up enhanced logging for a production web app to track usage patterns",
        "Log retention: Configuring longer log retention periods for compliance or audit requirements",
        "Advanced debugging: Enabling detailed log levels for troubleshooting complex issues"
      ]
    },
    {
      "task": "Stream the script execution logs in real-time",
      "answer": "clasp tail-logs [options]",
      "description": "Streams execution logs directly to your terminal in real-time, showing console.log output and errors as they occur.",
      "whenToUse": "When debugging your script and you want to see logs without leaving the terminal.",
      "scenarios": [
        "Live debugging: Watching logs in real-time while testing your script's functionality",
        "Error monitoring: Using --watch flag to continuously monitor for errors in a running web app",
        "Development workflow: Viewing console.log output while developing without switching to the browser"
      ]
    },
    {
      "task": "Open the Apps Script editor in browser",
      "answer": "clasp open-script [scriptId]",
      "description": "Opens your Apps Script project in the online editor in your default web browser.",
      "whenToUse": "When you need to quickly access the web editor for visual editing, project settings, or features not available in clasp.",
      "scenarios": [
        "Visual editing: Opening the editor to use the UI builder for creating custom menus or dialogs",
        "Project settings: Accessing the web interface to configure triggers, libraries, or permissions",
        "Quick checks: Verifying how your code appears in the online editor or testing the script there"
      ]
    },
    {
      "task": "Open the container-bound document/sheet",
      "answer": "clasp open-container",
      "description": "Opens the Google Doc, Sheet, Form, or Slides presentation that your script is bound to in your web browser.",
      "whenToUse": "When working with container-bound scripts and you need to access the parent document.",
      "scenarios": [
        "Sheet testing: Opening the bound spreadsheet to test custom menu items or sheet functions",
        "Form configuration: Accessing the form that your script processes submissions for",
        "Document context: Viewing the document structure while developing container-bound automation"
      ]
    },
    {
      "task": "Open the deployed web app in browser",
      "answer": "clasp open-web-app [deploymentId]",
      "description": "Opens a specific deployment of your web app in your browser, using the deployment's public URL.",
      "whenToUse": "When you want to quickly test or view a deployed version of your web application.",
      "scenarios": [
        "Deployment testing: Opening a new deployment to verify it's working correctly before sharing with users",
        "Version comparison: Opening different deployment IDs to compare behavior between versions",
        "Quick access: Launching your web app without manually copying and pasting the deployment URL"
      ]
    },
    {
      "task": "Execute a function in the script",
      "answer": "clasp run-function [functionName] [options]",
      "description": "Remotely executes a specific function in your Apps Script project directly from the command line, returning the results to your terminal.",
      "whenToUse": "When you want to test functions or run one-off scripts without manually triggering them in the editor.",
      "scenarios": [
        "Function testing: Running and testing individual functions during development without the web editor",
        "One-off tasks: Executing data migration or cleanup functions from your terminal",
        "CI/CD integration: Running test functions as part of automated deployment pipelines"
      ]
    },
    {
      "task": "List all Apps Script projects for current user",
      "answer": "clasp list-scripts [options]",
      "description": "Displays all Apps Script projects accessible by your currently authenticated Google account, showing script IDs and titles.",
      "whenToUse": "When you need to find a script ID or see all your available projects.",
      "scenarios": [
        "Script discovery: Finding the script ID of a project you want to clone",
        "Project inventory: Viewing all your scripts to decide which ones to work on locally",
        "Account audit: Checking what script projects are associated with your Google account"
      ]
    },
    {
      "task": "Create a new version of the script",
      "answer": "clasp create-version [description]",
      "description": "Creates an immutable snapshot of your current script code as a numbered version. This version can then be deployed.",
      "whenToUse": "When you want to create a stable reference point before deploying or making major changes.",
      "scenarios": [
        "Pre-deployment: Creating a version with a description before deploying to production",
        "Release tagging: Marking significant milestones like 'v2.0 - Added user authentication'",
        "Safe refactoring: Creating a version before major code changes so you can easily revert if needed"
      ]
    },
    {
      "task": "List all versions of a script project",
      "answer": "clasp list-versions [scriptId]",
      "description": "Shows all saved versions of your script with their version numbers, descriptions, and creation dates.",
      "whenToUse": "When you need to review version history or find a specific version number for deployment or rollback.",
      "scenarios": [
        "Version audit: Reviewing the history of your project to understand when changes were made",
        "Rollback planning: Finding the version number of a stable release to redeploy",
        "Documentation: Getting version information for release notes or change logs"
      ]
    },
    {
      "task": "Start the Model Context Protocol server",
      "answer": "clasp mcp",
      "description": "Starts a Model Context Protocol (MCP) server that allows AI assistants and tools to interact with your Apps Script projects through a standardized interface.",
      "whenToUse": "When you want to enable AI-assisted development or integrate your Apps Script projects with MCP-compatible tools.",
      "scenarios": [
        "AI development: Enabling an AI assistant like Claude to help write and modify your Apps Script code",
        "Tool integration: Connecting automated development tools that use the MCP protocol",
        "Enhanced workflows: Using MCP-compatible IDEs that provide enhanced Apps Script development features"
      ]
    }
  ],
  "clasp-advanced": [
    {
      "task": "Authenticate for CI/CD pipeline on a headless server",
      "answer": "clasp login --no-localhost",
      "description": "Disables the local redirect server during authentication, requiring manual code entry instead. Essential for environments without a display or browser.",
      "whenToUse": "When setting up clasp authentication in CI/CD pipelines, Docker containers, or remote servers without GUI access.",
      "scenarios": [
        "GitHub Actions workflow: Using --no-localhost to authenticate in a CI runner where you can't launch a browser",
        "Docker container: Setting up clasp in a containerized build environment without display capabilities",
        "Cloud Build: Authenticating in Google Cloud Build or similar headless CI/CD systems"
      ]
    },
    {
      "task": "Use custom OAuth credentials for running functions",
      "answer": "clasp login --creds client_secret.json",
      "description": "Uses a custom OAuth client ID/secret file instead of clasp's default credentials. Required for clasp run and organization-specific deployments.",
      "whenToUse": "When you need to use organization-specific OAuth credentials or when setting up clasp run functionality.",
      "scenarios": [
        "Enterprise deployment: Using your company's OAuth client to comply with security policies",
        "Function execution: Setting up credentials required for 'clasp run' to work properly",
        "Multiple environments: Different credentials for dev, staging, and production environments"
      ]
    },
    {
      "task": "Manage multiple Google accounts for different projects",
      "answer": "clasp login --user client-a",
      "description": "Stores credentials under a named key, allowing you to switch between multiple Google accounts without re-authenticating each time.",
      "whenToUse": "When you work with multiple clients or maintain projects across different Google accounts.",
      "scenarios": [
        "Freelance developer: Switching between client accounts with 'clasp login --user client-a' and 'clasp login --user client-b'",
        "Agency work: Managing separate credentials for different organizational accounts",
        "Personal vs work: Keeping personal projects and work projects separate with named credential sets"
      ]
    },
    {
      "task": "Specify custom port for OAuth redirect during login",
      "answer": "clasp login --redirect-port 8888",
      "description": "Sets a custom port for the local OAuth redirect server instead of the default. Useful when the default port is blocked or in use.",
      "whenToUse": "When port conflicts exist with other services or when firewall rules require specific ports.",
      "scenarios": [
        "Port conflict: Default port 3000 is already used by your React dev server, so use 8888 instead",
        "Firewall restrictions: Company firewall only allows specific ports for OAuth redirects",
        "Multiple simultaneous logins: Running multiple clasp login sessions on different ports"
      ]
    },
    {
      "task": "Create a script bound to a specific Google Sheet",
      "answer": "clasp create-script --type sheets --parentId 1abc...xyz",
      "description": "Creates a container-bound script attached to a specific Google Sheet, Form, Doc, or Slides. The script has special access to the container document.",
      "whenToUse": "When building custom functions, menus, or automation for a specific Google Workspace document.",
      "scenarios": [
        "Custom sheet functions: Creating a script bound to a sales tracking sheet to add custom formulas and automation",
        "Form processor: Binding a script to a Google Form to process responses with custom logic",
        "Document automation: Creating a script bound to a template document for mail merge functionality"
      ]
    },
    {
      "task": "Create project in a subdirectory instead of current folder",
      "answer": "clasp create-script --rootDir ./apps-scripts/my-project",
      "description": "Specifies where clasp stores project files locally, instead of using the current directory. Keeps your workspace organized.",
      "whenToUse": "When organizing multiple scripts in a monorepo or when the current directory isn't the right location.",
      "scenarios": [
        "Monorepo structure: Creating script in './packages/gas-automation' within a larger project",
        "Clean separation: Keeping scripts in './src/apps-script' separate from other code",
        "Multiple scripts: Organizing different scripts in './scripts/email-sender', './scripts/sheet-updater', etc."
      ]
    },
    {
      "task": "Create a new Apps Script project with a specific title and type",
      "answer": "clasp create-script --title \"Sales Dashboard\" --type sheets",
      "description": "Creates a new Apps Script project with a custom title and type. Valid types are: standalone, sheets, docs, slides, and forms. Note: 'web app' is a deployment type (how you publish), not a project type. Use --type sheets when you want the script bound to a Sheet. Any project type can later be deployed as a web app.",
      "whenToUse": "When you want a descriptive name and need to specify whether the script should be standalone or bound to a specific Google Workspace document type.",
      "scenarios": [
        "Sheet-bound app: Creating 'Sales Dashboard' bound to Sheets so it can access spreadsheet data and add custom menus",
        "Team collaboration: Using descriptive titles like 'Q4 Report Generator' for team projects to make them easily identifiable",
        "Form automation: Creating 'Survey Processor' with --type forms to handle form submissions with custom logic"
      ]
    },
    {
      "task": "Clone a specific historical version of a script",
      "answer": "clasp clone-script scriptId 42",
      "description": "Clones a specific version number instead of the latest code. Useful for auditing, debugging, or rolling back.",
      "whenToUse": "When you need to examine or work with an older version of a script.",
      "scenarios": [
        "Bug investigation: Cloning version 38 to see what the code looked like before a bug was introduced",
        "Audit requirements: Retrieving the exact code version that was deployed on a specific date",
        "Rollback preparation: Cloning the last known good version (v42) to restore functionality"
      ]
    },
    {
      "task": "Clone a script into a specific directory",
      "answer": "clasp clone-script scriptId --rootDir ./legacy-scripts",
      "description": "Clones a script into a specific local directory instead of the current folder.",
      "whenToUse": "When organizing cloned scripts or when you don't want files in your current directory.",
      "scenarios": [
        "Archive old scripts: Cloning deprecated scripts to './archive/2024' for reference",
        "Team structure: Each developer clones to their own folder like './developers/john/scripts'",
        "Clean workspace: Cloning to './temp/review' for quick code review without cluttering main directory"
      ]
    },
    {
      "task": "Auto-push code changes whenever files are saved",
      "answer": "clasp push --watch",
      "description": "Monitors local files and automatically pushes changes to Apps Script whenever you save. Eliminates manual push commands during development.",
      "whenToUse": "During active development when you want instant synchronization with the cloud version.",
      "scenarios": [
        "Rapid development: Making frequent small changes and testing immediately in the web editor",
        "Live debugging: Watching logs in browser while editing locally with auto-sync",
        "Paired programming: One person codes locally while another tests in the Apps Script editor"
      ]
    },
    {
      "task": "Force push to overwrite cloud changes without confirmation",
      "answer": "clasp push --force",
      "description": "Pushes local code and overwrites cloud changes without asking for confirmation. Use with caution.",
      "whenToUse": "When you're certain your local version is correct and want to overwrite cloud changes.",
      "scenarios": [
        "Undo web edits: You accidentally edited in the web editor and want to restore from local",
        "CI/CD pipeline: Automated deployments where manual confirmation isn't possible",
        "Solo development: You know you're the only one working on it and don't need confirmation prompts"
      ]
    },
    {
      "task": "Pull a specific version number to your local machine",
      "answer": "clasp pull --versionNumber 15",
      "description": "Downloads a specific historical version instead of the latest code. The version number corresponds to versions created with 'clasp version'.",
      "whenToUse": "When you need to recover or examine a specific saved version of your code.",
      "scenarios": [
        "Time travel debugging: Pulling version 15 to see what the code looked like before refactoring",
        "Production recovery: Pulling the version currently deployed to production for emergency fixes",
        "Comparison: Pulling version 10 to compare against current code to understand changes"
      ]
    },
    {
      "task": "Deploy a specific version number",
      "answer": "clasp create-deployment --versionNumber 23 --description \"Production release v2.0\"",
      "description": "Creates a new deployment using a specific saved version. Ensures you deploy tested, versioned code rather than the latest changes.",
      "whenToUse": "When deploying to production and you want to use a specific tested version.",
      "scenarios": [
        "Controlled releases: Deploying version 23 that passed QA, not the latest untested code",
        "Rollback capability: Creating deployment from version 20 which was the last stable release",
        "Multi-environment: Deploying version 22 to staging while production stays on version 20"
      ]
    },
    {
      "task": "Update an existing deployment with new code",
      "answer": "clasp update-deployment AKfyc...xyz --description \"Bug fix release\"",
      "description": "Updates an existing deployment instead of creating a new one. Maintains the same deployment URL.",
      "whenToUse": "When you want to update a deployment without changing its URL or creating a new deployment entry.",
      "scenarios": [
        "Production update: Updating the production deployment without breaking user bookmarks",
        "Web app fix: Pushing a hotfix to the live web app while keeping the same public URL",
        "Client delivery: Updating the client's deployment ID without requiring them to change their integration"
      ]
    },
    {
      "task": "Remove all deployments at once",
      "answer": "clasp delete-deployment --all",
      "description": "Removes every deployment for the script in one command, instead of removing them one by one.",
      "whenToUse": "When you want to clean up all deployments and start fresh.",
      "scenarios": [
        "Fresh start: Removing all old test deployments before creating clean production deployment",
        "Project sunset: Decommissioning a project by removing all its deployments at once",
        "Deployment cleanup: Too many test deployments accumulated, easier to remove all and redeploy"
      ]
    },
    {
      "task": "Stream logs continuously in real-time",
      "answer": "clasp tail-logs --watch",
      "description": "Continuously monitors and displays new log entries as they occur, refreshing every 5 seconds. Like 'tail -f' for Apps Script logs.",
      "whenToUse": "When debugging a running script or monitoring production web app activity.",
      "scenarios": [
        "Live debugging: Watching logs while triggering your web app to see real-time execution flow",
        "Production monitoring: Keeping logs open to watch for errors in a live deployment",
        "Trigger testing: Monitoring logs while time-based or event triggers fire to verify behavior"
      ]
    },
    {
      "task": "View logs in JSON format for parsing",
      "answer": "clasp tail-logs --json",
      "description": "Outputs logs as JSON instead of human-readable format. Useful for programmatic processing or log aggregation tools.",
      "whenToUse": "When integrating logs with monitoring tools or when you need to parse log data programmatically.",
      "scenarios": [
        "Log aggregation: Piping JSON logs to Elasticsearch or Splunk for centralized monitoring",
        "Automated analysis: Using jq to filter and analyze error patterns in JSON log output",
        "CI/CD testing: Parsing JSON logs in test scripts to verify function execution"
      ]
    },
    {
      "task": "View simplified logs without timestamps",
      "answer": "clasp tail-logs --simplified",
      "description": "Removes timestamps and metadata from log output, showing only the actual log messages.",
      "whenToUse": "When you only care about the log messages themselves, not when they occurred.",
      "scenarios": [
        "Quick scanning: Removing clutter to quickly scan for specific error messages",
        "Copy-paste: Getting clean log messages without timestamps for pasting into documentation",
        "Pattern matching: Easier to spot repeated messages without timestamp noise"
      ]
    },
    {
      "task": "Combine multiple log options for customized output",
      "answer": "clasp tail-logs --watch --simplified",
      "description": "Multiple flags can be combined. This watches logs in real-time while showing simplified output.",
      "whenToUse": "When you want real-time monitoring with cleaner output format.",
      "scenarios": [
        "Development flow: Watching simplified logs while coding to focus on messages, not timestamps",
        "Error hunting: Real-time simplified logs make it easier to spot error patterns",
        "Team debugging: Sharing clean, continuous log output in screen sharing sessions"
      ]
    },
    {
      "task": "Run a function with specific user credentials",
      "answer": "clasp run-function myFunction --user prod-account",
      "description": "Executes a function using a specific named credential set. Useful when different accounts have different permissions.",
      "whenToUse": "When you need to run functions with specific account permissions or test multi-account scenarios.",
      "scenarios": [
        "Permission testing: Running with --user admin to test admin-only functions vs --user standard for regular users",
        "Production execution: Using --user prod-account with production credentials for safe deployments",
        "Client impersonation: Running as a specific client account to debug their specific issues"
      ]
    },
    {
      "task": "Use a different .clasp.json configuration file",
      "answer": "clasp push --project .clasp.production.json",
      "description": "Reads settings from an alternate configuration file instead of .clasp.json. Enables managing multiple environments.",
      "whenToUse": "When managing multiple deployment targets or environments for the same codebase.",
      "scenarios": [
        "Multi-environment: 'clasp push --project .clasp.dev.json' for dev, '.clasp.prod.json' for production",
        "A/B testing: Maintaining separate script IDs for experimental and stable versions",
        "Client variants: Different .clasp files for different client customizations of the same base code"
      ]
    },
    {
      "task": "Use application default credentials for service accounts",
      "answer": "clasp push --adc",
      "description": "Uses Application Default Credentials from the environment instead of user credentials. Essential for service account authentication in CI/CD.",
      "whenToUse": "When running clasp commands in automated environments with service account authentication.",
      "scenarios": [
        "Cloud Build: Using --adc with service account credentials in Google Cloud Build pipelines",
        "Kubernetes: Running clasp commands in pods with workload identity",
        "Automated deployments: GitHub Actions using service account key from environment variables"
      ]
    },
    {
      "task": "Use custom .claspignore file location",
      "answer": "clasp push --ignore ./config/.claspignore.production",
      "description": "Specifies a different file containing ignore patterns instead of the default .claspignore.",
      "whenToUse": "When you need different ignore rules for different environments or build targets.",
      "scenarios": [
        "Production builds: Using stricter ignore rules that exclude test files and dev dependencies",
        "Development: Different ignore file that includes test files for development deployments",
        "Multi-config: Separate ignore rules for different deployment targets in monorepo"
      ]
    },
    {
      "task": "Get command output in JSON format for scripting",
      "answer": "clasp list-deployments --json",
      "description": "Returns command output as JSON instead of human-readable format. Works with most clasp commands.",
      "whenToUse": "When integrating clasp with scripts, CI/CD pipelines, or other automation tools.",
      "scenarios": [
        "Deployment automation: Parsing JSON output to extract deployment IDs for scripted workflows",
        "Monitoring dashboard: Feeding clasp status info into monitoring tools via JSON",
        "Build scripts: Using jq to extract specific values from clasp command output in bash scripts"
      ]
    },
    {
      "task": "Set up clasp for team development with Git",
      "answer": "clasp clone-script scriptId --rootDir ./src && echo '.clasp.json' >> .gitignore",
      "description": "Clones to a source directory and excludes .clasp.json from Git so each developer can have their own script ID.",
      "whenToUse": "When setting up a collaborative development workflow with version control.",
      "scenarios": [
        "Team onboarding: Each developer clones to their own test script using their own .clasp.json",
        "Fork development: Multiple team members work on feature branches with separate script instances",
        "Safe collaboration: .clasp.json in .gitignore prevents accidentally pushing to wrong script"
      ]
    },
    {
      "task": "Deploy with version control best practices",
      "answer": "clasp push && clasp create-version \"v2.1.0\" && clasp create-deployment --versionNumber <number> --description \"Release v2.1.0\"",
      "description": "Complete workflow: push code, create version with semantic versioning, deploy that specific version.",
      "whenToUse": "When following deployment best practices with proper version tracking.",
      "scenarios": [
        "Release process: Push changes, tag version 'v2.1.0', deploy that version to production",
        "Audit trail: Create versions with descriptions matching Git tags for traceability",
        "Rollback safety: Always deploy from versions, never from HEAD, so you can easily rollback"
      ]
    },
    {
      "task": "Watch and auto-push with force to override confirmations",
      "answer": "clasp push --watch --force",
      "description": "Combines watch mode with force flag to auto-push changes without any prompts or confirmations.",
      "whenToUse": "During solo rapid development when you want zero friction between code and deployment.",
      "scenarios": [
        "Prototype iteration: Rapidly testing ideas with instant push and no interruptions",
        "Solo project: You're the only developer and don't need safety prompts",
        "Live coding: Demonstrating code changes in real-time during presentations or teaching"
      ]
    }
  ],
  "clasp-scenarios": [
    {
      "task": "Your nonprofit's Donor Management System has a critical bug in production. Users report that donation receipts aren't being sent. You need to immediately pull down the latest version from the cloud to debug locally.",
      "answer": "clasp pull",
      "description": "Downloads the current production code from Google Apps Script to your local machine so you can investigate the donation receipt bug in your local development environment.",
      "whenToUse": "When you need to sync the latest cloud changes to your local environment for debugging, especially in emergency situations where others may have made changes in the online editor.",
      "scenarios": [
        "Emergency debugging: A critical bug is reported in production and you need to get the exact code that's running",
        "Post-collaboration sync: Team members made hotfixes directly in the Apps Script editor and you need those changes locally",
        "Version verification: Confirming what code is actually deployed before making additional changes"
      ]
    },
    {
      "task": "You've fixed the donation receipt bug in your Donor Management System locally. Now you need to deploy version 12 to production with the description 'Fix donation receipt email bug - urgent hotfix'.",
      "answer": "clasp create-deployment --versionNumber 12 --description 'Fix donation receipt email bug - urgent hotfix'",
      "description": "Creates a new deployment of version 12 with a descriptive message so your team knows this is the hotfix for the receipt issue.",
      "whenToUse": "When pushing a critical fix to production with a specific version number and clear documentation of what changed.",
      "scenarios": [
        "Hotfix deployment: Immediately deploying a critical bug fix with clear documentation",
        "Version-specific release: Deploying a tested version rather than the latest HEAD",
        "Audit trail: Creating deployments with descriptions that document what changed and why"
      ]
    },
    {
      "task": "Your Volunteer Scheduling Tool (script ID: 1VolSchedule2024def456uvw012) was created in the online editor by a colleague. You need to start working on it locally with your preferred IDE and Git workflow.",
      "answer": "clasp clone-script 1VolSchedule2024def456uvw012",
      "description": "Downloads the Volunteer Scheduling Tool project to your local machine, creating the necessary .clasp.json configuration file that links your local directory to the remote script.",
      "whenToUse": "When transitioning a script from web-based development to local development, or when joining a project that was started by someone else.",
      "scenarios": [
        "Team onboarding: Cloning a colleague's project to contribute code from your local environment",
        "Workflow migration: Moving from the online editor to a local IDE with Git version control",
        "Project takeover: Taking ownership of a script created by a departing team member"
      ]
    },
    {
      "task": "You need to start building a new Grant Report Generator for your organization. It should be a standalone script titled 'Q4 2024 Grant Reports'.",
      "answer": "clasp create-script --type standalone --title 'Q4 2024 Grant Reports'",
      "description": "Creates a new standalone Apps Script project with the specified title, generating the necessary configuration files in your current directory.",
      "whenToUse": "When starting a brand new Apps Script project from scratch with local development in mind.",
      "scenarios": [
        "New automation: Building a new reporting tool from the ground up",
        "Standalone utility: Creating a script that runs independently, not bound to any document",
        "Project initialization: Setting up a new project with proper naming and type from the start"
      ]
    },
    {
      "task": "Your Email Campaign Automation script needs access to the Gmail API to send bulk emails. Enable this API for the project.",
      "answer": "clasp enable-api gmail",
      "description": "Adds the Gmail API to your Apps Script project's advanced services, allowing your code to send emails programmatically.",
      "whenToUse": "When your script needs to access Google services beyond the basic Apps Script APIs.",
      "scenarios": [
        "Email automation: Enabling Gmail API for sending campaign emails to donors",
        "Service integration: Adding APIs as new features require advanced Google services",
        "Permission setup: Granting your script access to necessary Google Workspace tools"
      ]
    },
    {
      "task": "You're working on the Event Registration Form and want to automatically push every code change as you save files during development.",
      "answer": "clasp push --watch",
      "description": "Starts a watch process that automatically uploads your local files to Google Apps Script whenever you save changes.",
      "whenToUse": "During active development when you want instant synchronization between your local editor and the Apps Script environment.",
      "scenarios": [
        "Rapid development: Testing changes quickly in the Apps Script environment without manual push commands",
        "Live testing: Seeing immediate results of code changes in connected Google Sheets or Forms",
        "Continuous sync: Maintaining real-time parity between local and cloud during intensive development sessions"
      ]
    },
    {
      "task": "Your Fundraising Dashboard deployment @HEAD has a critical bug. You need to check all current deployments to find the deployment ID so you can undeploy it.",
      "answer": "clasp list-deployments",
      "description": "Lists all active deployments of your Fundraising Dashboard, showing their deployment IDs, versions, and descriptions.",
      "whenToUse": "When you need to see what versions are currently deployed and get their IDs for management operations.",
      "scenarios": [
        "Emergency response: Finding the buggy deployment ID to quickly undeploy it",
        "Version audit: Checking which versions are live before making deployment decisions",
        "Deployment inventory: Understanding your current production landscape"
      ]
    },
    {
      "task": "After reviewing deployments, you found that deployment AKfycbwXYZ123 of your Fundraising Dashboard is the buggy version. Remove this deployment immediately.",
      "answer": "clasp delete-deployment AKfycbwXYZ123",
      "description": "Removes the specific deployment, making it immediately inaccessible to users while preserving the script code and other deployments.",
      "whenToUse": "When you need to quickly retire a specific deployment that has critical issues.",
      "scenarios": [
        "Emergency rollback: Immediately removing a broken deployment from production",
        "Version retirement: Taking down an old version after migration is complete",
        "Bug containment: Stopping users from accessing a deployment with known issues"
      ]
    },
    {
      "task": "Your Donor Management System has deployment AKfycbyABC789 in production. You've fixed bugs and want to update this specific deployment to version 15 without changing the deployment URL.",
      "answer": "clasp update-deployment AKfycbyABC789 --versionNumber 15",
      "description": "Updates the existing deployment to point to version 15, maintaining the same deployment ID and URL that donors are already using.",
      "whenToUse": "When you want to push updates to a production deployment without requiring users to change their access URL.",
      "scenarios": [
        "Seamless updates: Pushing bug fixes without disrupting user bookmarks or embedded URLs",
        "Production maintenance: Updating live deployments with new features transparently",
        "Version promotion: Moving a tested version to the production deployment"
      ]
    },
    {
      "task": "You're setting up a new developer workstation and need to authenticate clasp to manage your nonprofit's Apps Script projects.",
      "answer": "clasp login",
      "description": "Opens a browser to authenticate with Google and creates credentials that allow clasp to manage your Apps Script projects.",
      "whenToUse": "First-time setup on a new machine or when re-authenticating after logout.",
      "scenarios": [
        "New machine setup: Configuring clasp on a new laptop for nonprofit development work",
        "Authentication refresh: Re-logging in after credentials expire or are cleared",
        "Account switching: Logging in with the correct organizational account"
      ]
    },
    {
      "task": "Your Grant Report Generator (script ID: 1GrantReport2024ghi789rst345) needs the Google Sheets API to read grant data. Enable this API for the project.",
      "answer": "clasp enable-api sheets",
      "description": "Adds the Google Sheets API to the Grant Report Generator's advanced services, allowing it to programmatically read and write spreadsheet data.",
      "whenToUse": "When your script needs advanced Sheets functionality beyond the basic SpreadsheetApp service.",
      "scenarios": [
        "Data integration: Enabling Sheets API to pull grant data from multiple spreadsheets",
        "Advanced features: Using API-specific functionality not available in basic services",
        "Cross-document access: Reading data from sheets the script isn't bound to"
      ]
    },
    {
      "task": "You're debugging the Email Campaign Automation script and want to see the exact code in version 8, which was the last working version before bugs appeared.",
      "answer": "clasp pull --versionNumber 8",
      "description": "Downloads version 8 of your Email Campaign script to your local machine, overwriting current local files.",
      "whenToUse": "When you need to retrieve a specific historical version for debugging or comparison.",
      "scenarios": [
        "Regression debugging: Comparing a working version with the current broken code",
        "Version recovery: Retrieving a known-good version to restart from",
        "Change investigation: Examining what changed between versions to find bug introduction point"
      ]
    },
    {
      "task": "Your team created 5 test deployments of the Volunteer Scheduling Tool during development. Clean up all deployments so you can start fresh for the production release.",
      "answer": "clasp delete-deployment --all",
      "description": "Removes all deployments of the current script, giving you a clean slate for new production deployments.",
      "whenToUse": "When you want to remove all test or old deployments before creating clean production versions.",
      "scenarios": [
        "Deployment cleanup: Removing all test deployments before official launch",
        "Fresh start: Clearing deployment history when restructuring release process",
        "Development reset: Cleaning up experimental deployments from prototyping phase"
      ]
    },
    {
      "task": "You need to open the Event Registration Form script (ID: 1EventReg2024pqr345stu901) in the Apps Script web editor to check the execution logs.",
      "answer": "clasp open-script 1EventReg2024pqr345stu901",
      "description": "Opens the Event Registration Form in your browser's Apps Script editor where you can view execution logs and test runs.",
      "whenToUse": "When you need to access the web-based editor for features like execution logs, triggers, or testing.",
      "scenarios": [
        "Log inspection: Checking execution logs to debug runtime errors",
        "Trigger management: Setting up time-based or event-based triggers in the web UI",
        "Quick testing: Using the web editor's run button for rapid function testing"
      ]
    },
    {
      "task": "Your nonprofit is shutting down the old 'Spring 2023 Fundraiser' script (ID: 1SpringFund2023old456xyz). Permanently delete this project as it's no longer needed.",
      "answer": "clasp delete-script 1SpringFund2023old456xyz",
      "description": "Permanently removes the Spring 2023 Fundraiser script from Google Drive. This action cannot be undone.",
      "whenToUse": "When you need to completely remove a script project that's obsolete and no longer serves any purpose.",
      "scenarios": [
        "Project cleanup: Removing completed seasonal campaigns or outdated tools",
        "Resource management: Cleaning up old test projects to keep your script library organized",
        "Security: Deleting scripts with outdated permissions or sensitive data no longer needed"
      ]
    },
    {
      "task": "You're about to do major refactoring on the Grant Report Generator and want to push changes without being prompted for confirmation each time.",
      "answer": "clasp push --force",
      "description": "Uploads your local files to Google Apps Script without prompting for confirmation, even if there are cloud changes.",
      "whenToUse": "When you're confident in your local changes and want to skip safety prompts during intensive development.",
      "scenarios": [
        "Solo development: Working alone on a project where you control all changes",
        "Rapid iteration: Testing multiple approaches quickly without confirmation delays",
        "Trusted workflow: When you know your local version is the authoritative source"
      ]
    },
    {
      "task": "Your Email Campaign Automation was using the Calendar API for scheduling, but you've refactored to use a different approach. Remove Calendar API access from the project.",
      "answer": "clasp disable-api calendar",
      "description": "Removes the Calendar API from the Email Campaign script's advanced services, following the principle of least privilege.",
      "whenToUse": "When you no longer need a specific API and want to reduce your project's permission scope.",
      "scenarios": [
        "Security hardening: Removing unused APIs to minimize permission footprint",
        "Permission cleanup: Disabling APIs after code refactoring eliminates their usage",
        "Compliance: Ensuring your script only has access to services it actively uses"
      ]
    },
    {
      "task": "Your Fundraising Dashboard needs access to the Drive API to generate PDF reports and save them to a specific folder. Enable this API for the project.",
      "answer": "clasp enable-api drive",
      "description": "Adds the Google Drive API to the Fundraising Dashboard's advanced services, allowing it to create and manage files programmatically.",
      "whenToUse": "When your script needs to perform advanced file operations in Google Drive beyond basic access.",
      "scenarios": [
        "Report generation: Creating PDF reports and organizing them in Drive folders",
        "File management: Programmatically managing document permissions or metadata",
        "Backup automation: Saving generated files to specific Drive locations for record-keeping"
      ]
    }
  ],
  "clasp-fundamentals": [
    {
      "task": "Explain the difference between Apps Script and clasp",
      "answer": "Apps Script is Google's JavaScript runtime for automation. clasp is the Command Line Apps Script Projects tool that lets you develop Apps Script locally.",
      "description": "Apps Script runs your code on Google's servers to automate Google Workspace. clasp is a development tool that syncs between your local files and Google's servers, enabling modern workflows like Git, TypeScript, and IDE integration.",
      "whenToUse": "Understand this distinction before starting any clasp project - Apps Script is what runs, clasp is how you develop.",
      "scenarios": [
        "Explaining to teammates: 'Apps Script is like Node.js for Google Workspace, clasp is like the npm CLI for managing those projects'",
        "Choosing tools: Use Apps Script web editor for quick prototypes, use clasp for serious projects with version control",
        "Troubleshooting: If code works in web editor but not locally, the issue is with clasp sync, not Apps Script itself"
      ]
    },
    {
      "task": "What is the .clasp.json file and what does it contain?",
      "answer": "Configuration file that links your local directory to a remote Apps Script project",
      "description": "The .clasp.json file stores the scriptId (unique identifier) and optionally the rootDir (source folder) and parentId (for container-bound scripts). This file tells clasp which remote project to sync with.",
      "whenToUse": "Created automatically by 'clasp create' or 'clasp clone'. You need this file in your project root for any clasp command to work.",
      "scenarios": [
        "Team setup: Add .clasp.json to .gitignore so each developer can work with their own test scripts",
        "Multi-environment: Use .clasp.dev.json and .clasp.prod.json with --project flag for different deployment targets",
        "Troubleshooting: If clasp says 'No scriptId found', you're missing .clasp.json or you're in the wrong directory"
      ]
    },
    {
      "task": "What is the appsscript.json manifest file?",
      "answer": "Configuration file that defines your Apps Script project's settings, dependencies, and permissions",
      "description": "The appsscript.json manifest specifies runtime version, OAuth scopes, enabled advanced services, time zone, library dependencies, and webapp settings. It's like package.json for Apps Script.",
      "whenToUse": "Automatically created with new projects. Edit it to add OAuth scopes, enable APIs, or configure webapp settings.",
      "scenarios": [
        "Adding APIs: Enable 'sheets' in advancedServices to use Sheets API v4 instead of just SpreadsheetApp",
        "OAuth scopes: Add explicit scopes to oauthScopes array when authorization prompts are too broad or missing permissions",
        "Webapp config: Set executeAs and access settings to control who can run your deployed web app"
      ]
    },
    {
      "task": "Explain the difference between container-bound and standalone scripts",
      "answer": "Container-bound scripts are attached to a specific Doc/Sheet/Form/Slides. Standalone scripts exist independently in Drive.",
      "description": "Container-bound scripts have special access to their parent document and appear in its Script Editor. Standalone scripts are independent projects that can work with any document (if granted permission).",
      "whenToUse": "Use container-bound for custom functions, menus, and automations specific to one document. Use standalone for multi-document tools, web apps, or reusable libraries.",
      "scenarios": [
        "Sheet automation: Create container-bound script with 'clasp create --type sheets --parentId <sheetId>' for custom functions accessible only in that sheet",
        "Email tool: Create standalone script for a Gmail automation tool that processes emails across your entire account",
        "Form processor: Bind to specific form with --type forms to process submissions with onFormSubmit trigger"
      ]
    },
    {
      "task": "What's the difference between a version and a deployment in Apps Script?",
      "answer": "A version is a saved snapshot of your code. A deployment is a version that's been published and given a URL/ID for public access.",
      "description": "Versions are immutable code snapshots created with 'clasp version'. Deployments make a specific version accessible via URL (for webapps) or execution ID (for APIs). One version can have multiple deployments.",
      "whenToUse": "Create versions before major changes for rollback safety. Create deployments when you want users to access your code.",
      "scenarios": [
        "Safe development: Create version 'v2.0-beta' before refactoring, so you can revert if needed",
        "Multiple environments: Deploy version 10 as 'staging' and version 8 as 'production' simultaneously",
        "Version history: Use 'clasp versions' to see all snapshots, 'clasp deployments' to see what's live"
      ]
    },
    {
      "task": "What are the main Apps Script project types and when to use each?",
      "answer": "standalone, sheets, docs, slides, forms - choose based on whether you need special access to a specific document type",
      "description": "Standalone scripts are independent. Container-bound types (sheets/docs/slides/forms) are attached to a parent document and have special privileges like onOpen, onEdit triggers and simpler document access.",
      "whenToUse": "Use container-bound when building features for a specific document. Use standalone for cross-document tools, web apps, or automation scripts.",
      "scenarios": [
        "Custom spreadsheet functions: --type sheets creates bound script with access to custom formulas and sheet-specific triggers",
        "Web application: --type standalone (or omit --type) for webapps that aren't tied to any document",
        "Survey processor: --type forms binds to a form for processing submissions via onFormSubmit trigger"
      ]
    },
    {
      "task": "How does .claspignore work and what should you typically ignore?",
      "answer": "Like .gitignore but for clasp push. Prevents local-only files from being uploaded to Apps Script.",
      "description": "Create a .claspignore file in your project root with glob patterns. Each line is a pattern for files to exclude from 'clasp push'. Useful for ignoring tests, configs, node_modules, and source maps.",
      "whenToUse": "Always create .claspignore for projects with dependencies, tests, or build tools. Prevents uploading unnecessary files.",
      "scenarios": [
        "TypeScript project: Ignore '**/*.ts' and '*.json' but push compiled .js files: pattern should exclude source, keep build output",
        "Node dependencies: Add 'node_modules/**' and 'package.json' since Apps Script can't use npm packages directly",
        "Test files: Ignore '**/*.test.js' and 'tests/**' to keep your deployed code clean and under size limits"
      ]
    },
    {
      "task": "What OAuth scopes are and why they matter in Apps Script",
      "answer": "OAuth scopes define what Google services your script can access (Gmail, Drive, Calendar, etc.)",
      "description": "When users run your script, Google asks them to authorize specific permissions (scopes). Apps Script auto-detects scopes from your code, but you can specify them explicitly in appsscript.json for better control.",
      "whenToUse": "Review scopes before sharing scripts. Add explicit scopes when auto-detection is too broad or misses necessary permissions.",
      "scenarios": [
        "Publishing add-on: OAuth review requires minimal scopes - explicitly set only what you need in appsscript.json",
        "Troubleshooting permissions: User gets 'insufficient permissions' error - add missing scope to oauthScopes array",
        "Security: Auto-detected scope is too broad (like 'mail.google.com') when you only need to send email - specify 'gmail.send' instead"
      ]
    },
    {
      "task": "What is the Apps Script runtime and how do you choose which version to use?",
      "answer": "The runtime is the JavaScript engine version (V8). Specify in appsscript.json with 'runtimeVersion': 'V8'",
      "description": "Modern Apps Script uses the V8 JavaScript engine (same as Chrome/Node.js), supporting ES6+ features like arrow functions, const/let, classes, etc. Legacy runtime (DEPRECATED) uses Rhino JavaScript.",
      "whenToUse": "Always use V8 for new projects. Only use legacy runtime if maintaining old scripts with Rhino-specific code.",
      "scenarios": [
        "New project: Set 'runtimeVersion': 'V8' in appsscript.json to enable modern JavaScript features",
        "Legacy migration: Encountering Rhino-specific code like 'Utilities.jsonParse()' - switch to native 'JSON.parse()' when migrating to V8",
        "Debugging: Code works in V8 but breaks in legacy - check for ES6 features that Rhino doesn't support"
      ]
    },
    {
      "task": "What are Apps Script libraries and how do you use them with clasp?",
      "answer": "Libraries are reusable Apps Script code packages. Add them via appsscript.json dependencies array with scriptId and version.",
      "description": "Libraries let you share code across projects. Reference them in appsscript.json under 'dependencies', then access via the library identifier in your code. Like npm packages but for Apps Script.",
      "whenToUse": "Create libraries for code shared across multiple Apps Script projects. Use existing libraries for common utilities.",
      "scenarios": [
        "Shared utilities: Create a library with common date formatting functions, use across 5 different spreadsheet tools",
        "Adding library: Get scriptId from library project's .clasp.json, add to dependencies: {'userSymbol': 'MyLib', 'libraryId': 'scriptId', 'version': '1'}",
        "Versioning: Pin to specific version ('version': '3') for stability or use '0' for development (HEAD)"
      ]
    },
    {
      "task": "Understanding the difference between Push and Deployment in clasp workflow",
      "answer": "Push uploads code to Apps Script editor (not public). Deployment publishes a version for end-users to access.",
      "description": "'clasp push' syncs your local code to the cloud for you to test in the editor. 'clasp deploy' creates a public deployment with a URL/ID that others can use. Push is development, deploy is production.",
      "whenToUse": "Push frequently during development. Deploy only when ready to release to users.",
      "scenarios": [
        "Daily dev workflow: 'clasp push' after each code change to test in Apps Script editor, no deployment needed",
        "Going live: After testing, 'clasp version' to snapshot, then 'clasp deploy' to publish for end-users",
        "Rollback: Pushed bad code? 'clasp pull' to get last good version. Deployed bad code? 'clasp undeploy' or update deployment to previous version"
      ]
    },
    {
      "task": "What file types can you develop locally with clasp?",
      "answer": ".js, .gs, .html - JavaScript/Google Script files and HTML for UIs. TypeScript .ts files work with transpilation.",
      "description": "Apps Script natively runs .gs (Google Script, same as .js) and .html files. With clasp you can write .js locally, or use .ts TypeScript files which clasp transpiles to .js before pushing.",
      "whenToUse": "Use .js for simple projects, .ts for type safety and modern IDE features. Use .html for custom dialogs, sidebars, and web apps.",
      "scenarios": [
        "JavaScript project: Create .js files locally, clasp pushes them as .gs files to Apps Script",
        "TypeScript setup: Create .ts files with @types/google-apps-script, transpile to .js, push compiled code",
        "Web UI: Create .html files for custom sidebars in Sheets - include CSS/JS inline or in <script>/<style> tags"
      ]
    }
  ],
  "clasp-troubleshooting": [
    {
      "task": "Error: 'Could not read API credentials. Are you logged in globally?' - How to fix?",
      "answer": "Run 'clasp login' to authenticate, or check that ~/.clasprc.json exists with valid credentials",
      "description": "This error means clasp can't find your authentication credentials. The global credentials file (~/.clasprc.json) is missing, corrupted, or you haven't logged in yet.",
      "whenToUse": "Common after fresh clasp installation or when credentials expire.",
      "scenarios": [
        "First-time setup: Install clasp globally with 'npm install -g @google/clasp', then 'clasp login' to authenticate",
        "Expired credentials: Run 'clasp login' again to refresh your OAuth tokens",
        "Wrong user: Check '~/.clasprc.json' to see which Google account is authenticated, logout and re-login if needed"
      ]
    },
    {
      "task": "Authentication fails with SSL certificate error - How to fix?",
      "answer": "Clear localhost from HSTS list in browser, or use 'clasp login --no-localhost' and manually enter the code",
      "description": "Browser forcing HTTPS on localhost breaks clasp's OAuth callback. The local server clasp creates for auth doesn't have SSL, causing certificate errors.",
      "whenToUse": "When browser redirects localhost to HTTPS during clasp login, causing connection refused errors.",
      "scenarios": [
        "Chrome/Edge fix: Navigate to edge://net-internals/#hsts, enter 'localhost' under 'Delete domain security policies' and click Delete",
        "Alternative method: Use 'clasp login --no-localhost', manually copy authorization code from browser to terminal",
        "CI/CD environments: Always use --no-localhost in automated pipelines where you can't open a browser"
      ]
    },
    {
      "task": "Error: 'Looks like you are offline' but you have internet - How to fix?",
      "answer": "Check firewall/proxy settings blocking googleapis.com, or try 'clasp login' again to refresh credentials",
      "description": "This error occurs when clasp can't reach Google's APIs due to network restrictions, proxy configs, or expired tokens that fail to refresh.",
      "whenToUse": "When you have internet but clasp commands timeout or return offline error.",
      "scenarios": [
        "Corporate network: Configure proxy settings or request IT to whitelist *.googleapis.com domains",
        "VPN issues: Disconnect VPN and retry, or configure VPN to allow Google API access",
        "Credential refresh: Delete ~/.clasprc.json and run 'clasp login' to get fresh tokens"
      ]
    },
    {
      "task": "Google Workspace admin restrictions prevent clasp login - How to fix?",
      "answer": "Admin must enable 'Google Apps Script API' in Admin Console under Security > API Controls > App access control",
      "description": "Google Workspace organizations can restrict API access. If your admin has blocked the Apps Script API, clasp login will fail with authorization errors.",
      "whenToUse": "When personal Gmail accounts work but your @company.com Workspace account fails to authorize clasp.",
      "scenarios": [
        "Admin action required: Go to admin.google.com > Security > Access and data control > API controls > Manage Third-Party App Access > Configure new app > Apps Script API",
        "Workaround: Use a personal Google account for development, share final scripts with work account",
        "Enterprise setup: Work with IT to enable Apps Script API org-wide or for your department"
      ]
    },
    {
      "task": "Error: 'Missing credentials' when trying 'clasp run' - How to fix?",
      "answer": "Create OAuth credentials with 'clasp open --creds', download JSON, then 'clasp login --creds <file>'",
      "description": "clasp run requires custom OAuth credentials (not the default clasp ones) to execute functions remotely. You must create credentials in GCP Console.",
      "whenToUse": "Before using 'clasp run' to execute Apps Script functions from command line.",
      "scenarios": [
        "Setup steps: 1) clasp open --creds 2) Create OAuth client ID (Desktop app) 3) Download JSON as creds.json 4) clasp login --creds creds.json 5) clasp run myFunction",
        "Project-specific creds: Each Apps Script project can have its own OAuth client for better security isolation",
        "Troubleshooting: If run still fails, ensure Apps Script API is enabled in the GCP project linked to your script"
      ]
    },
    {
      "task": "Push conflicts: local and remote have diverged - How to resolve?",
      "answer": "Choose: 'clasp pull' to get remote changes (discards local), 'clasp push --force' to overwrite remote (discards cloud), or manually merge",
      "description": "Happens when both local and cloud versions have changed (someone edited in web editor while you worked locally). Clasp won't auto-merge, you must choose which version wins.",
      "whenToUse": "When clasp push shows conflict warnings about remote changes.",
      "scenarios": [
        "Solo dev, you edited in browser: 'clasp pull' to get web changes, reapply your local changes, then 'clasp push'",
        "Team member pushed: Pull their changes first, resolve conflicts manually in your code, then push",
        "You know local is correct: 'clasp push --force' to overwrite cloud - use carefully, you'll lose cloud edits"
      ]
    },
    {
      "task": "Deployment succeeds but webapp shows old code - How to fix?",
      "answer": "Clear browser cache, or create new deployment instead of updating @HEAD - @HEAD caching issues are common",
      "description": "Apps Script aggressively caches webapp deployments. Even after successful deployment update, users may see old code for minutes/hours due to CDN caching.",
      "whenToUse": "When 'clasp deploy' succeeds but testing the webapp URL shows previous version's behavior.",
      "scenarios": [
        "Quick fix: Open webapp in incognito/private window to bypass browser cache",
        "Force new version: Create new deployment with version number instead of updating @HEAD: 'clasp version' then 'clasp deploy --versionNumber N'",
        "Permanent solution: Use versioned deployments in production, never use @HEAD for live webapps"
      ]
    },
    {
      "task": "Error: 'Script file must be in root directory' - How to fix?",
      "answer": "Set 'rootDir' in .clasp.json to point to your source directory, like 'rootDir': 'src'",
      "description": "Clasp by default expects files in the same directory as .clasp.json. If you organize code in subdirectories (like src/), you must configure rootDir.",
      "whenToUse": "When you want to keep source code in a subdirectory for better project organization.",
      "scenarios": [
        "Organized structure: .clasp.json and package.json in root, code in src/ - add 'rootDir': 'src' to .clasp.json",
        "TypeScript build: Source .ts files in src/, compiled .js in dist/ - set 'rootDir': 'dist' to push only compiled code",
        "Monorepo: Multiple clasp projects in packages/*/ - each has .clasp.json with appropriate rootDir"
      ]
    },
    {
      "task": "Files not uploading despite being in project - How to troubleshoot?",
      "answer": "Check .claspignore patterns, verify rootDir setting, ensure files are .js/.gs/.html, check file size limits",
      "description": "Common reasons files don't push: ignored by .claspignore, outside rootDir, wrong extension, or exceeding size limits. Apps Script has limits on total project size.",
      "whenToUse": "When 'clasp push' succeeds but expected files don't appear in Apps Script editor.",
      "scenarios": [
        "Check ignore patterns: Review .claspignore - wildcards like '*.ts' might unintentionally match files you want to push",
        "Verify rootDir: If rootDir is 'src/', files in 'lib/' won't push - move them or adjust structure",
        "File size: Apps Script projects limited to 50 files and specific size constraints - split large files or use libraries"
      ]
    },
    {
      "task": "TypeError: Cannot read scriptId in clasp command - How to fix?",
      "answer": "You're in wrong directory or .clasp.json is missing/malformed. Navigate to project root or run 'clasp clone' to create it",
      "description": "Most clasp commands need .clasp.json with valid scriptId. This error means clasp can't find or parse that configuration file.",
      "whenToUse": "When any clasp command (push, pull, open, deploy) fails with scriptId error.",
      "scenarios": [
        "Wrong directory: 'cd' into your project folder where .clasp.json exists before running clasp commands",
        "Missing config: If new project, run 'clasp create' to generate .clasp.json. If existing, run 'clasp clone <scriptId>'",
        "Malformed JSON: Open .clasp.json, check for syntax errors - must be valid JSON with 'scriptId' field"
      ]
    },
    {
      "task": "Apps Script API not enabled error - How to enable?",
      "answer": "Visit script.google.com/home/usersettings and turn on 'Google Apps Script API' toggle",
      "description": "The Apps Script API must be enabled in your Google account settings for clasp to work. This is a one-time setup per Google account.",
      "whenToUse": "Usually during first-time clasp setup when you get 'Apps Script API has not been used' error.",
      "scenarios": [
        "First-time enable: Navigate to script.google.com/home/usersettings, enable the API toggle, retry clasp command",
        "New Google account: Each account needs API enabled separately - enable it for work and personal accounts",
        "Organization account: If toggle is grayed out, contact Workspace admin to enable API at org level"
      ]
    },
    {
      "task": "Deployment fails with 'User has not enabled the Apps Script Deployment API' - How to fix?",
      "answer": "Enable Apps Script API at script.google.com/home/usersettings, ensure you're logged in with correct account",
      "description": "Similar to general API error but specifically for deployment operations. The deployment API subset needs explicit enabling.",
      "whenToUse": "When clasp deploy or undeploy commands fail but other clasp commands work.",
      "scenarios": [
        "Enable deployment API: Visit script.google.com/home/usersettings and enable Apps Script API if not already done",
        "Account mismatch: Verify you're logged into clasp with same account that owns the script - check with 'clasp whoami'",
        "Workspace restrictions: Admin may have disabled deployment API - request IT to enable in Admin Console"
      ]
    },
    {
      "task": "'clasp status' shows no changes but you know files changed - Why?",
      "answer": "Status compares against last pull, not remote. Run 'clasp pull' first to sync remote state, then check status again",
      "description": "clasp status compares local files against your last pulled version, not the current cloud state. If someone pushed after your last pull, status won't show those changes.",
      "whenToUse": "When you need to see what's different between local and current remote state.",
      "scenarios": [
        "Get accurate status: 'clasp pull' to sync remote, 'clasp status' to see local changes vs that sync point",
        "Team collaboration: Before pushing, pull first to avoid overwriting teammate's changes",
        "Alternative: Use 'git diff' for local changes if you track with Git - more reliable than clasp status"
      ]
    },
    {
      "task": "Remote function execution fails with permission denied - How to fix?",
      "answer": "Ensure OAuth credentials are set up correctly with 'clasp login --creds', and function is not private/library-only",
      "description": "clasp run executes functions remotely via Apps Script API. Requires proper OAuth setup and function must be at top level, not inside objects or marked private.",
      "whenToUse": "When 'clasp run functionName' fails with authorization or execution errors.",
      "scenarios": [
        "OAuth setup: Create Desktop app OAuth credentials in GCP Console, download JSON, run 'clasp login --creds creds.json'",
        "Function visibility: Ensure function is top-level (not inside object/class) and name doesn't start with underscore",
        "Test function: Start simple with 'clasp run' on basic function like 'function test() { return \"hello\"; }' to verify setup"
      ]
    },
    {
      "task": "How to fix 'ReferenceError: module is not defined' in Apps Script after pushing?",
      "answer": "Remove Node.js-style exports (module.exports, exports) - Apps Script doesn't support CommonJS modules",
      "description": "Apps Script doesn't have Node.js module system. If you write 'module.exports = ...' locally, it will error when executed in Apps Script cloud runtime.",
      "whenToUse": "When code works locally but fails in Apps Script with module/exports/require not defined.",
      "scenarios": [
        "Remove CommonJS: Delete 'module.exports' and 'require()' statements - use global functions instead",
        "TypeScript setup: Configure tsconfig.json with 'module': 'None' or use rollup/webpack to bundle without module wrappers",
        "Function sharing: Use Apps Script libraries instead of npm-style modules for code reuse across projects"
      ]
    }
  ]
}
