{
  "id": "git-branches",
  "title": "Branching",
  "description": "Creating and managing branches for features and fixes",
  "difficulty": "intermediate",
  "category": "git",
  "estimatedTime": "15 min",
  "cardCount": 8,
  "cards": [
    {
      "id": "branch-1",
      "task": "Create and switch to a new feature branch",
      "answer": "git switch -c feature/<name>",
      "description": "Creates a new branch off the current HEAD and moves your working tree to it in one step.",
      "whenToUse": "Starting scoped work that should be isolated from main until review.",
      "scenarios": [
        "New feature: Begin work on a feature without touching main",
        "Bugfix branch: Isolate hotfix changes for a quick pull request",
        "Spike: Explore an idea safely without polluting stable branches"
      ],
      "set_id": "git-branches"
    },
    {
      "id": "branch-2",
      "task": "List local and remote branches",
      "answer": "git branch -a",
      "description": "Shows all branches, including remote-tracking ones, so you know what exists and where.",
      "whenToUse": "Before switching, cleaning up stale branches, or checking if a branch already exists on origin.",
      "scenarios": [
        "Avoid duplicates: Confirm a teammate already pushed a branch before creating your own",
        "Cleanup: Identify stale local branches to delete",
        "Tracking: Verify a branch is published to origin before opening a PR"
      ],
      "set_id": "git-branches"
    },
    {
      "id": "branch-3",
      "task": "Update your feature branch with the latest main",
      "answer": "git fetch origin && git rebase origin/main",
      "description": "Fetches new commits from origin and rebases your current branch on top of the updated main branch.",
      "whenToUse": "Before opening or updating a PR to minimize merge conflicts and keep history linear.",
      "scenarios": [
        "PR refresh: Rebase before requesting review so diff only shows your changes",
        "Conflict prevention: Reduce chances of merge conflicts by staying current",
        "CI stability: Rebase to include the latest main fixes before rerunning pipelines"
      ],
      "set_id": "git-branches"
    },
    {
      "id": "branch-4",
      "task": "Merge a completed branch into the current branch",
      "answer": "git merge --no-ff feature/<name>",
      "description": "Merges another branch into the current one while preserving a merge commit for history clarity.",
      "whenToUse": "When you want a merge commit to mark integration of a feature or PR.",
      "scenarios": [
        "Release integration: Merge a feature branch into main after approval",
        "Audit trail: Keep a merge commit to show when a feature landed",
        "Conflict resolution: Perform the merge locally to resolve conflicts before pushing"
      ],
      "set_id": "git-branches"
    },
    {
      "id": "branch-5",
      "task": "Delete a local branch",
      "answer": "git branch -d <branch-name>",
      "description": "Removes a local branch that's been merged (use -D to force delete unmerged branches).",
      "whenToUse": "After a feature branch has been merged and is no longer needed.",
      "scenarios": [
        "Post-merge cleanup: Delete feature branch after PR is merged",
        "Housekeeping: Remove old branches cluttering your local repo",
        "Start fresh: Delete a branch to recreate it from scratch"
      ],
      "set_id": "git-branches"
    },
    {
      "id": "branch-6",
      "task": "Cherry-pick a specific commit onto the current branch",
      "answer": "git cherry-pick <commit>",
      "description": "Applies the changes from a single commit to your current branch, creating a new commit with the same diff.",
      "whenToUse": "When you need one commit from another branch without merging the whole branch.",
      "scenarios": [
        "Hotfix backport: Bring a fix from main to a release branch",
        "Selective adoption: Grab a useful change from a teammate's branch",
        "PR cleanup: Move a commit from one branch to another without redoing work"
      ],
      "set_id": "git-branches"
    },
    {
      "id": "branch-7",
      "task": "Create an annotated tag for a release",
      "answer": "git tag -a v<version> -m \"Release v<version>\"",
      "description": "Creates a named, annotated tag that records the release message and metadata at the current commit.",
      "whenToUse": "When marking a release candidate or production release in the repository history.",
      "scenarios": [
        "Versioning: Tagging v1.2.0 before publishing a GitHub release",
        "Hotfix marker: Tagging a patch release off a maintenance branch",
        "Deployment traceability: Tag commits that correspond to deployed artifacts"
      ],
      "set_id": "git-branches"
    },
    {
      "id": "branch-8",
      "task": "Push a specific tag to origin",
      "answer": "git push origin v<version>",
      "description": "Sends an annotated tag to the remote repository so teammates and CI/CD can use it.",
      "whenToUse": "After creating a release tag locally and you want it available on GitHub.",
      "scenarios": [
        "Release distribution: Make the tag visible for GitHub Releases or package pipelines",
        "Coordination: Share a tag so others can check out the exact release commit",
        "Automation triggers: Push a tag that kicks off release workflows in CI"
      ],
      "set_id": "git-branches"
    }
  ]
}
